tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "wez/wezterm"

cask_args appdir: "~/Applications", require_sha: true

brew "bandwhich"
brew "bash"
brew "bat"
brew "bat-extras"
brew "bottom"
brew "btop"
brew "curl"
brew "exa"
brew "fd"
brew "fnm"
brew "fzf"
brew "gcc", args: ["force-bottle"]
brew "gdu"
brew "git"
brew "git-delta"
brew "git-extras"
brew "glab"
brew "glow"
brew "hub"
brew "hyperfine"
brew "jenv"
brew "jq"
brew "lazydocker"
brew "lazygit"
brew "lolcat"
brew "mas"
brew "neovim"
brew "nmap"
brew "openjdk"
brew "openssh"
brew "openssl@3", args: ["force-bottle"]
brew "parallel"
brew "pkg-config", args: ["force-bottle"]
brew "protobuf"
brew "python3"
brew "ripgrep"
brew "rustup-init"
brew "shellcheck"
brew "stow"
brew "taskell"
brew "thefuck"
brew "tldr"
brew "telnet"
brew "tmux"
brew "trash-cli"
brew "tz"
brew "viddy"
brew "watson"
brew "websocat"
brew "wget"
brew "wifi-password"
brew "yadm"
brew "zellij"
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

cask "brave-browser"
cask "clipy"
cask "deepl"
cask "docker"
cask "expressvpn"
cask "font-fira-code-nerd-fon
cask "font-hack-nerd-font"
cask "font-inconsolata-for-powerline"
cask "font-menlo-for-powerline"t"
cask "git-credential-manager"
cask "hiddenbar"
cask "nvidia-geforce-now"
cask "popcorn-time"
cask "postman"
cask "rectangle"
cask "tableplus"
cask "the-unarchiver"
cask "vlc"
cask "webtorrent"
cask "wezterm"
cask "zoom"

mas "Amphetamine", id: 937984704
mas "Bitwarden", id: 1352778147
mas "Goodnotes", id: 1444383602
mas "Twitter", id: 1482454543
mas "WeChat", id: 836500024
mas "Xcode", id: 497799835

