cask_args appdir: "~/Applications"

tap 'homebrew/cask-fonts'
# cask 'xquartz'

brew 'gcc', args: ["force-bottle"]
brew 'openssl', args: ["force-bottle"]
brew 'gettext', args: ["force-bottle"]
brew 'pkg-config', args: ["force-bottle"]

# use GNU coreutils
# $PATH is modified in $ZDOTDIR/env_config.zsh to make linux/mac consistent
brew 'coreutils'
brew 'diffutils'
brew 'findutils'
brew 'gawk'
brew 'gnu-getopt'
# brew 'gnu-indent'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnu-which'
# brew 'gnutls'
brew 'grep'
brew 'moreutils'

# install dependencies
brew 'elixir', args: ["force-bottle"]
brew 'go', args: ["force-bottle"]
brew 'node', args: ["force-bottle"]
brew 'openjdk', args: ["force-bottle"]
brew 'perl', args: ["force-bottle"]
brew 'pnpm'
brew 'python3'
brew 'ruby'
brew 'rust'
brew 'rustup-init'

# install newer version of otherwise ancient software
brew 'atuin'
brew 'bash'
brew 'curl'
brew 'gpatch'
brew 'git'
brew 'gzip'
brew 'less'
brew 'openssh', args: ["force-bottle"]
brew 'python'
brew 'rsync'
brew 'vim'
brew 'zsh'

# generic installs
brew 'bandwhich'
brew 'bat'
brew 'bottom'
brew 'boxes'
brew 'btop'
brew 'duti'
brew 'eza'
brew 'fd'
brew 'fnm'
brew 'fzf'
brew 'gdu'
brew 'gh'
brew 'git-delta'
brew 'glab'
brew 'glow'
brew 'hyperfine'
brew 'jq'
brew 'lazydocker'
brew 'lazygit'
brew 'lolcat'
brew 'mas'
brew 'mercurial'
brew 'nmap'
brew 'nvim', args: ["HEAD"]
brew 'parallel'
brew 'ripgrep'
brew 'shellcheck'
brew 'stow'
brew 'taskell'
brew 'telnet'
brew 'thefuck'
brew 'tmux'
brew 'trash'
brew 'tree-sitter', args: ["HEAD"]
brew 'tz'
brew 'viddy'
brew 'watch'
brew 'watson'
brew 'websocat'
brew 'wget', args: ["force-bottle"]
brew 'wifi-password'
brew 'yadm'
brew 'zoxide'

# zsh
cask 'font-source-code-pro'
cask 'font-hack-nerd-font'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'

# fonts
cask 'font-fira-code-nerd-font'
cask 'font-fira-code'
cask 'font-source-code-pro'
cask 'font-hack-nerd-font'

# Applications
cask 'alfred'
cask 'brave-browser'
cask 'mpv'
# cask 'git-credential-manager'
cask 'wezterm'
